[
  {
    "id": 1,
    "title": "What is the Gospel?",
    "category": "Gospel Basics",
    "excerpt": "A simple explanation of the Good News.",
    "content": "The Gospel is the good news that Jesus Christ came into this world to save sinners. Through His life, death, and resurrection, He offers forgiveness to all who believe. As Romans 5:8 says, 'But God demonstrates His own love for us in this: While we were still sinners, Christ died for us.' The Gospel is not just information, it is the power of God for salvation (Romans 1:16), transforming hearts and lives."
  },
  {
    "id": 2,
    "title": "Why We Need Salvation",
    "category": "Gospel Basics",
    "excerpt": "Understanding our need for redemption.",
    "content": "Every person has sinned and fallen short of God's glory (Romans 3:23). Sin separates us from a holy God, leaving us spiritually dead. But God in His mercy provides a way through Jesus Christ. John 14:6 says, 'I am the way and the truth and the life. No one comes to the Father except through me.' Salvation is a gift, received by faith, not by works (Ephesians 2:8-9). We need salvation because it restores our relationship with God and gives us eternal life."
  },
  {
    "id": 3,
    "title": "How to Pray",
    "category": "Christian Living",
    "excerpt": "A guide to starting your prayer life.",
    "content": "Prayer is our personal conversation with God. It is both talking and listening. Jesus taught us to pray with sincerity and humility, as in Matthew 6:6, 'But when you pray, go into your room, close the door and pray to your Father, who is unseen.' Prayer brings peace, guidance, and a deeper connection with God. Start small: thank God, confess sins, ask for help, and pray for others. Make it consistent, and let the Holy Spirit guide your words (Romans 8:26)."
  },
  {
    "id": 4,
    "title": "Who is Jesus?",
    "category": "Christology",
    "excerpt": "Exploring the identity of Jesus Christ.",
    "content": "Jesus Christ is fully God and fully man, the Son of God sent to redeem humanity. John 1:1-14 tells us that the Word became flesh and dwelt among us. He lived a perfect life, performed miracles, taught about the Kingdom of God, died on the cross for our sins, and rose again on the third day. Believing in Him brings salvation (Acts 4:12). Jesus is our teacher, Savior, and Lord, worthy of worship and obedience."
  },
  {
    "id": 5,
    "title": "Living by Faith",
    "category": "Christian Living",
    "excerpt": "Understanding faith in everyday life.",
    "content": "Faith means trusting God even when life is uncertain. Hebrews 11:1 defines it as 'the assurance of things hoped for, the conviction of things not seen.' Living by faith requires obedience, patience, and hope in God’s promises. We may not see immediate results, but God is faithful. Examples like Abraham, who trusted God to provide a son, show us how faith leads to blessing and growth. Faith sustains us, comforts us, and allows God to work in and through us."
  },
  {
  "id": 6,
  "title": "The Power of Forgiveness",
  "category": "Christian Living",
  "excerpt": "Understanding why forgiveness is essential for our spiritual and emotional health.",
  "content": "Forgiveness is one of the most powerful principles in the Christian life. It is not just about saying 'I forgive you,' but about releasing the burden of resentment and letting God restore your heart. Holding onto anger or bitterness harms your relationship with God and others. As Jesus taught in Matthew 6:14-15, 'For if you forgive other people when they sin against you, your heavenly Father will also forgive you.' Forgiveness does not mean excusing wrongdoing, but trusting God to bring justice and healing. When we forgive, we reflect the love and mercy that God has shown to us through Christ. Forgiveness brings peace, freedom, and emotional healing. It also restores relationships and opens the door to reconciliation. Practicing forgiveness daily, even in small situations, strengthens your character and allows the Holy Spirit to work in your life. Remember, true forgiveness is a choice, often made repeatedly, and it mirrors the grace God extends to all who believe in Him. Colossians 3:13 reminds us, 'Bear with each other and forgive one another if any of you has a grievance against someone. Forgive as the Lord forgave you.' By embracing forgiveness, we live in alignment with God’s heart, experience inner freedom, and reflect His love to the world around us."
}


]

